#!/bin/bash

# Запоминаем время начала
start_time=$(date +%s.%N)

# Подключаем функции
source ./directory_info.sh

[ $# -ne 1 ] && { echo "Ошибка: Правильное использование: $0 <путь_к_директории>/"; exit 1; }
[[ "$1" != */ ]] && { echo "Ошибка: Путь должен заканчиваться на /"; exit 1; }
[ ! -d "$1" ] && { echo "Ошибка: Директория '$1' не существует"; exit 1; }
[ ! -r "$1" ] && { echo "Ошибка: Нет прав на чтение директории '$directory'"; exit 1; }
[ ! -w "$1" ] && { echo "Предупреждение: Нет прав на запись в директорию '$directory'"; }

directory="$1"
echo "====================================================================================================================================>>"
echo "Анализируем директорию: $directory"
echo "====================================================================================================================================>>"
echo ""
get_directory_info "$directory"

# Запоминаем время окончания
end_time=$(date +%s.%N)

# Вычисляем разницу
execution_time=$(echo "$end_time - $start_time" | bc)

echo "Script execution time (in seconds): $execution_time"
