#!/bin/bash

# Функция для проверки количества аргументов
validate_argument_count() {
    if [ $# -ne 1 ]; then
        echo "Передайте 1 параметр:"
        echo "Использование: $0 параметр со значением 1, 2, 3 или 4"
        echo "Параметр 1: Все записи, отсортированные по коду ответа"
        echo "Параметр 2: Все уникальные IP, встречающиеся в записях"
        echo "Параметр 3:Все запросы с ошибками (код ответа — 4хх или 5хх);
        echo "Параметр 4:Все уникальные IP, которые встречаются среди ошибочных запросов.
        echo "Пример: main.sh 3"
        exit 1
    fi
}

# Функция проверки числа
validate_digit() {
    local num="$1"
    local re='^[1-4]$'
    if ! [[ $num =~ $re ]]; then
        echo "Ошибка: Параметр "$num" должен быть целым положительным числом 1, 2, 3, 4" >&2
        exit 1
    fi
}

check_parametrs() {
    parametr="$1"
    # Проверка количества аргументов
    validate_argument_count "$@"
    # Проверка, что параметр число
    validate_digit "$parametr"
}
